### Problem Statement: me, my friend, and my other friend are three guys who have been given three movies, now we were asked that would you like to rate these three movies between 1 to 5, 1 means you didn't liked it and 5 means you liked it most.
### Now we can predict a lot of things obviously with that if and only only if we have rated all the movies i.e., all three movies, now there are likely to very less chances that if somebody you gave a movie is gonna rate it. So some ratings might ne be available. So either you can remove those null values, fill with mean or mode.

In [1]:
import numpy as np
import pandas as pd

In [3]:
myData = {'me': [3, 5, np.NaN], 'mf': [4, np.NaN, np.NaN], 'mof': [3, 5, 4]}

In [4]:
myData

{'me': [3, 5, nan], 'mf': [4, nan, nan], 'mof': [3, 5, 4]}

In [5]:
myDataFrame  = pd.DataFrame(myData)

In [6]:
myDataFrame

    me   mf  mof
0  3.0  4.0    3
1  5.0  NaN    5
2  NaN  NaN    4

In [8]:
myDataFrame.dropna() #remember this change is not permanent until you use aixs=1

    me   mf  mof
0  3.0  4.0    3

In [10]:
myDataFrame.fillna(value=myDataFrame['me'].mean()) # filling with mean of 'me' i.e., 3+5/2 = 4.0

    me   mf  mof
0  3.0  4.0    3
1  5.0  4.0    5
2  4.0  4.0    4